a = int (input ('укажите количество секунд'))
b = a // 3600
c = (a -(b * 3600)) // 60
d = a - ((c * 60) + (b * 3600))
print (b, ':', c, ':', d)
